Revit 2024 API
ParameterTypeId.FamilyEnableCuttingInViews Property
 "Enable Cutting in Views"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FamilyEnableCuttingInViews { get; }
Visual Basic
Public Shared ReadOnly Property FamilyEnableCuttingInViews As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FamilyEnableCuttingInViews {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace